[{
  "_id": {
    "$oid": "5fd9ab94448e728b2ae5c0cf"
  },
  "imagePath": "images/a1.png",
  "title": "2011 Yamaha YZF-R1",
  "t2": "Sportski motor",
  "year": 2011,
  "price": 13590,
  "priceStr": "13,590",
  "topspeed": "293",
  "time60": "2.64",
  "mileage": "17",
  "engine": 998,
  "cyl": 4,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": "Plava, Crna",
  "interior": "Koža",
  "body": "",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "The R1’s 998cc inline-four-cylinder engine features Yamaha’s exclusive crossplane crankshaft technology derived from Yamaha's YZR-M1 MotoGP® race bike. By equalizing inertial forces at the crankshaft, the CP4 motor delivers a direct feeling of linear torque, giving the rider the ultimate connection between throttle grip and the rear wheel.",
  "safety": "Developed on racetracks around the world, Yamaha’s Brake Control (BC) System works with an Anti-lock Braking System (ABS) to minimize brake slip under aggressive braking or on less than ideal surfaces. The adjustable BC System uses the IMU to provide progressive brake force intervention as lean angle increases which boosts rider confidence when braking mid-corner.",
  "technology": "The R1’s Traction Control System (TCS) calculates the differences in front and rear wheel speeds to monitor and reduce unwanted wheel spin during hard acceleration. Unlike many simplified TC systems, the R1 also uses the IMU to calculate lean angle, then adjusts the amount of TCS intervention to best suit the rider’s demands. The TCS offers ten separate settings enabling the rider to dial in the exact level of control needed."
},{
  "_id": {
    "$oid": "5fd9b952448e728b2ae5c273"
  },
  "imagePath": "images/au1.jpg",
  "title": "2006 Honda CBR600F4i",
  "t2": "Sportski motor",
  "year": 2006,
  "price": 8499,
  "priceStr": "8,499",
  "topspeed": "249",
  "time60": "3.6",
  "mileage": "19",
  "engine": 599,
  "cyl": 4,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": "Crvena, Crna",
  "interior": "Koža",
  "body": "4 Door Sedan",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "High-output liquid-cooled DOHC 16-valve four-stroke engine features oversquare bore and stroke of 67mm x 42.5mm with a straight intake tract contributing to superb power throughout the rpm range.",
  "safety": "Pro Frame design consists of an aluminum twin-spar frame and extruded aluminum swingarm. The Pro Frame design locates the lightweight extruded aluminum box-section swingarm via a combined pivot in both the frame and the rear of the engine, producing superb handling and stability with excellent control.",
  "technology": "Instrument display features analog tachometer with white numerals and needle indicator on a black face design; LCD digital displays for speedometer, odometer, A/B tripmeter, fuel reserve, clock, and coolant temperature; warning lights for coolant temperature, oil temperature, fuel injection, and over-rev; indicator lights for low/high beam, turn indicator and neutral."
},{
  "_id": {
    "$oid": "5fd9bc84448e728b2ae5c2bd"
  },
  "imagePath": "images/fi1.png",
  "title": "2017 Yamaha MT-07",
  "t2": "Naked motor",
  "year": 2017,
  "price": 6990,
  "priceStr": "6,990",
  "topspeed": "205",
  "time60": "3.73",
  "mileage": "22.85",
  "engine": 689,
  "cyl": 2,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": " Crvena, Crna",
  "interior": "Koža",
  "body": "",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "The MT-07 features an updated, compact 689cc liquid-cooled, inline twin cylinder, DOHC engine with fuel injection. The unique power character of the engine provides outstanding low- to mid-range torque with a linear throttle response and strong high-rpm pulling power. Maximizing riding excitement in the real world, the engine maintains the same level of response due to its intake air duct design, exhaust system specs - now integrated 2-into-1 exhaust pipes and muffler - and updated ECU specs. The fuel injection settings were also optimized to bring refinements to the engine’s linear response characteristics while the throttle is slightly open at low rpm. Other updates include new valve seats with excellent abrasion resistance for the exhaust side, improved gearshift feel thanks to different cut angles for the dog gears, and repositioning for the catalytic converter - now closer to the headers - and oxygen sensor.",
  "safety": "With new LED lighting for the position lights, headlight and both front and rear turn signals, the MT-07 exhibits clear and powerful illumination with a modern design.",
  "technology": "Joining the third generation MT style - as featured on the MT-09 - the MT-07's new look further brings out its distinctive appeal with fashion-leading colors and graphics. The newly designed parts and components are integrated with minimal structural elements, creating an attractive design that emphasizes pure Hyper Naked character. With a silhouette that is synonymous with the MT Series' signature statement of torque and power, the MT-07 showcases a tight, compact and powerful appearance."
},{
  "_id": {
    "$oid": "5fd9df43448e728b2ae5c595"
  },
  "imagePath": "images/je.png",
  "title": "2017 Yamaha MT-09",
  "t2": "Naked motor",
  "year": 2017,
  "price": 12299,
  "priceStr": "12,299",
  "topspeed": "225",
  "time60": "2.95",
  "mileage": "20.8",
  "engine": 847,
  "cyl": 3,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": "Žuta, Crna",
  "interior": "Koža",
  "body": "",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "The MT-09 features a newly developed 890cc liquid-cooled three-cylinder, DOHC, four-valve-per-cylinder fuel-injected (YCC-T) engine with a downdraft intake. The bore × stroke of 78 mm × 62.1 mm and 11.5:1 compression ratio provide outstanding torque with strong power delivery characteristics. Almost all of the fundamental parts of the engine, from the pistons and connecting rods to the crankshaft, camshafts and crankcase, have all been redesigned with a reduction in weight. The combination of improved combustion efficiency and lighter weight results in an impressive 11% improvement in fuel efficiency as well, from 44 MPG to 49 MPG.",
  "safety": "The Traction Control System (TCS) detects the difference in speed between the front and rear wheels and helps to efficiently extract drive force from the rear tire during acceleration. The new TCS on the MT-9 uses this data for the lean angle, estimated by the IMU to adjust the degree of intervention by the TCS. As the lean angle increases, so does the amount of TCS intervention (1 = little intervention; 2 = moderate intervention; 3 = strong intervention).",
  "technology": "With the Brake Control (BC) system, data for the front and rear wheel speed as well as data from the IMU is compiled and calculated in real-time in the hydraulic unit assembly (including the ABS control unit) to independently control and modulate the front and rear brake pressure. The rider can select between two intervention modes: BC1 and BC2. BC1 is a standard ABS-active mode that accommodates hard emergency braking in upright, straight-line braking conditions while BC2 controls the brake pressure in addition to ABS and operates in situations where machine behavior is likely to become unsettled, such as unavoidable panic braking mid-corner."
},{
  "_id": {
    "$oid": "5fd9e766448e728b2ae5c649"
  },
  "imagePath": "images/panigale.png",
  "title": "2019 Ducati Panigale V4",
  "t2": "Sportski motor",
  "year": 2018,
  "price": 28395,
  "priceStr": "28,395",
  "topspeed": "299",
  "time60": "2.9",
  "mileage": "11.8",
  "engine": 1103,
  "cyl": 4,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": "Crvena",
  "interior": "Koža",
  "body": "",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "The Desmosedici Stradale R is a more responsive engine that allows to ensure a greater sprint. This results in 221 HP (162 kW) that react immediately to the throttle inputs, delivered at 15,250 rpm (values referring to EU type-approval). Impressive figures that become even more amazing by fitting the full-racing exhaust Ducati Performance by Akrapovič: the maximum power to 234 HP (174 kW) at 15,500 rpm.",
  "safety": "The Front Frame of the Panigale V4R, developed in collaboration with the engineers of Ducati Corse, is optimised for racing use with fully mechanical Öhlins steering damper and suspensions, including the new pressurised front fork and the swinging arm with four-way adjustable pin.",
  "technology": "The Panigale V4 R is equipped with the latest generation electronic package, that manages all riding phases, based on the use of the 6-axis inertial platform by Bosch (6D IMU – Inertial Measurement Unit). The Pit Limiter makes its debut on the bike, limiting its speed when riding in the pit lane."
},{
  "_id": {
    "$oid": "5fda1f57448e728b2ae5c7a7"
  },
  "imagePath": "images/bmw.png",
  "title": "2014 BMW S1000RR",
  "t2": "Sportski motor",
  "year": 2014,
  "price": 16999,
  "priceStr": "16,999",
  "topspeed": "302",
  "time60": "3.1",
  "mileage": "14.9",
  "engine": 999,
  "cyl": 4,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": "Plava, Bela, Crna",
  "interior": "Koža",
  "body": "2 Door Coupe",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "Always pushing to the limit and in search of the ideal line, you've got 205 HP beneath you. Unbridled power pushes your RR to the max - with a maximum torque of 83 lb-ft at 11,000 rpm and a torque curve of at least 74 lb-ft over a range of 5,500 to 14,500 [rpm]. Ten years after the first generation of the RR first mesmerized the world of motorcycles, we're now entering the next level of performance. We have updated almost every component of the RR - from the front to the rear. The result: less weight and noticeably higher performance. Are you ready for the pole position and for victory? The RR awaits you.",
  "safety": "The RR has standard ABS and ABS Pro, depending on your riding mode: RAIN, ROAD, DYNAMIC, RACE or optional RACE Pro-1 to 3. So you decide whether your bike needs the maximum stability or the highest possible performance.",
  "technology": "When you first accelerate you will immediately notice: that this bike's torque curve is captivating even at low and middle speeds thanks to BMW's ShiftCam technology. The intake valves are controlled as needed by means of a control camshaft. Depending on the speed, the valve lift and timing of the valve opening are adjusted to ensure the best performance for you and your RR."
},{
  "_id": {
    "$oid": "5fda2e52448e728b2ae5c982"
  },
  "imagePath": "images/gsxr.png",
  "title": "2017 Suzuki GSX-R1000",
  "t2": "Sportski motor",
  "year": 2017,
  "price": 15799,
  "priceStr": "15,799",
  "topspeed": "292",
  "time60": "3.1",
  "mileage": "13.2",
  "engine": 999,
  "cyl": 4,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": "Plava, Crna",
  "interior": "Koža",
  "body": "",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "DOHC, inline-four engine produces great top-end power with a strong low- to mid-range pull thanks to the exclusive Suzuki Variable Valve Timing (VVT) system and the highly efficient 4-2-1 exhaust with a revised muffler and heat shield.",
  "safety": "Advanced Showa suspension combines with ABS-equipped Brembo T-drive front brake rotors and four-piston calipers for extraordinary handling and stopping performance.",
  "technology": "Advanced electronics include the Suzuki Bi-Directional Quick Shift System as standard equipment, an Inertia Measurement Unit, S-DMS adjustable engine output, and Traction Control* to increase track and street performance."
},{
  "_id": {
    "$oid": "5fda32f1448e728b2ae5c9f0"
  },
  "imagePath": "images/r6.png",
  "title": "2016 Yamaha YZF-R6",
  "t2": "Sportski motor",
  "year": 2016,
  "price": 11490,
  "priceStr": "11,490",
  "topspeed": "259,6",
  "time60": "3,19",
  "mileage": "17",
  "engine": 599,
  "cyl": 4,
  "gearbox": "6 brzina",
  "transmission": "Manuelni",
  "colour": "Žuta, Crna",
  "interior": "Koža",
  "body": "",
  "drivetrain": "Lanac",
  "wheel": "17'",
  "description": "Beauty, Technology, Speed: The YZF-R6 has it all! On track or street, the YZF-R6® is one of the most advanced supersport machines ever built. Aerodynamic MotoGP® styling wraps up an incredibly intelligent racing machine, complete with ABS brakes, top-shelf suspension and a full suite of electronic rider aids.",
  "safety": "A Traction Control System (TCS) assists the rider in managing traction on various road conditions by quickly modulating throttle opening, ignition timing and fuel volume. On the R6, the TCS is designed to intervene extremely smoothly, for minimal disruption to forward drive, with six modes (plus off) to suit various road conditions and rider preferences.",
  "technology": "The YZF-R6 features Yamaha’s D-Mode system, allowing the rider to choose the optimum engine character for their riding situation and preferences. The rider can choose from three throttle valve control maps (Standard Mode, “A” Mode, and “B” Mode) for different throttle response characteristics at the push of a button."
}]